Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x7FFFF7DB">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN" />
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA" />
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP" />
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN" />
            <bitfield caption="Secondary Oscillator Kick Start Programmability bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST" />
            <bitfield caption="Primary Crystal Oscillator Course Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN" />
            <bitfield caption="Primary Oscillator Boost bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST" />
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN" />
         </register>
         <register caption="BOOT FLASH 1 SEQUENCE WORD 0 REGISTER" name="BF1SEQ" initval="0xFFFF0000">
            <bitfield caption="Boot Flash True Sequence Number bits" mask="0xffff" name="TSEQ" values="BF1SEQ3__TSEQ" />
            <bitfield caption="Boot Flash Complement Sequence Number bits" mask="0xffff0000" name="CSEQ" values="BF1SEQ3__CSEQ" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="USB2 USBID Selection bit" name="DEVCFG3__FUSBIDIO2">
         <value caption="USBID pin is controlled by the USB2 module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB2 VBUSON Selection bit" name="DEVCFG3__FVBUSIO2">
         <value caption="VBUSON pin is controlled by the USB2 module" name="ON" value="0x1" />
         <value caption="VBUSON pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Permission Group Lock One Way Configuration bit" name="DEVCFG3__PGL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB1 USBID Selection bit" name="DEVCFG3__FUSBIDIO1">
         <value caption="USBID pin is controlled by the USB module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB1 VBUSON Selection bit" name="DEVCFG3__FVBUSIO1">
         <value caption="VBUSON pin is controlled by the USB1 module" name="ON" value="0x1" />
         <value caption="VBUSON pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 3" name="DIV_3" value="0x2" />
         <value caption="Divide by 4" name="DIV_4" value="0x3" />
         <value caption="Divide by 5" name="DIV_5" value="0x4" />
         <value caption="Divide by 6" name="DIV_6" value="0x5" />
         <value caption="Divide by 7" name="DIV_7" value="0x6" />
         <value caption="Divide by 8" name="DIV_8" value="0x7" />
      </value-group>
      <value-group caption="System PLL Divided Input Clock Frequency Range bits" name="DEVCFG2__FPLLRNG">
         <value caption="Bypass" name="RANGE_BYPASS" value="0x0" />
         <value caption="5-10 MHz" name="RANGE_5_10_MHZ" value="0x1" />
         <value caption="8-16 MHz" name="RANGE_8_16_MHZ" value="0x2" />
         <value caption="13-26 MHz" name="RANGE_13_26_MHZ" value="0x3" />
         <value caption="21-42 MHz" name="RANGE_21_42_MHZ" value="0x4" />
         <value caption="34-64 MHz" name="RANGE_34_64_MHZ" value="0x5" />
      </value-group>
      <value-group caption="System PLL Input Clock Select bit" name="DEVCFG2__FPLLICLK">
         <value caption="FRC is selected as input to the System PLL" name="PLL_FRC" value="0x1" />
         <value caption="POSC is selected as input to the System PLL" name="PLL_POSC" value="0x0" />
      </value-group>
      <value-group caption="System PLL Feedback Divider bits" name="DEVCFG2__FPLLMULT">
         <value caption="Multiply by 1" name="MUL_1" value="0x0" />
         <value caption="Multiply by 2" name="MUL_2" value="0x1" />
         <value caption="Multiply by 3" name="MUL_3" value="0x2" />
         <value caption="Multiply by 4" name="MUL_4" value="0x3" />
         <value caption="Multiply by 5" name="MUL_5" value="0x4" />
         <value caption="Multiply by 6" name="MUL_6" value="0x5" />
         <value caption="Multiply by 7" name="MUL_7" value="0x6" />
         <value caption="Multiply by 8" name="MUL_8" value="0x7" />
         <value caption="Multiply by 9" name="MUL_9" value="0x8" />
         <value caption="Multiply by 10" name="MUL_10" value="0x9" />
         <value caption="Multiply by 11" name="MUL_11" value="0xa" />
         <value caption="Multiply by 12" name="MUL_12" value="0xb" />
         <value caption="Multiply by 13" name="MUL_13" value="0xc" />
         <value caption="Multiply by 14" name="MUL_14" value="0xd" />
         <value caption="Multiply by 15" name="MUL_15" value="0xe" />
         <value caption="Multiply by 16" name="MUL_16" value="0xf" />
         <value caption="Multiply by 17" name="MUL_17" value="0x10" />
         <value caption="Multiply by 18" name="MUL_18" value="0x11" />
         <value caption="Multiply by 19" name="MUL_19" value="0x12" />
         <value caption="Multiply by 20" name="MUL_20" value="0x13" />
         <value caption="Multiply by 21" name="MUL_21" value="0x14" />
         <value caption="Multiply by 22" name="MUL_22" value="0x15" />
         <value caption="Multiply by 23" name="MUL_23" value="0x16" />
         <value caption="Multiply by 24" name="MUL_24" value="0x17" />
         <value caption="Multiply by 25" name="MUL_25" value="0x18" />
         <value caption="Multiply by 26" name="MUL_26" value="0x19" />
         <value caption="Multiply by 27" name="MUL_27" value="0x1a" />
         <value caption="Multiply by 28" name="MUL_28" value="0x1b" />
         <value caption="Multiply by 29" name="MUL_29" value="0x1c" />
         <value caption="Multiply by 30" name="MUL_30" value="0x1d" />
         <value caption="Multiply by 31" name="MUL_31" value="0x1e" />
         <value caption="Multiply by 32" name="MUL_32" value="0x1f" />
         <value caption="Multiply by 33" name="MUL_33" value="0x20" />
         <value caption="Multiply by 34" name="MUL_34" value="0x21" />
         <value caption="Multiply by 35" name="MUL_35" value="0x22" />
         <value caption="Multiply by 36" name="MUL_36" value="0x23" />
         <value caption="Multiply by 37" name="MUL_37" value="0x24" />
         <value caption="Multiply by 38" name="MUL_38" value="0x25" />
         <value caption="Multiply by 39" name="MUL_39" value="0x26" />
         <value caption="Multiply by 40" name="MUL_40" value="0x27" />
         <value caption="Multiply by 41" name="MUL_41" value="0x28" />
         <value caption="Multiply by 42" name="MUL_42" value="0x29" />
         <value caption="Multiply by 43" name="MUL_43" value="0x2a" />
         <value caption="Multiply by 44" name="MUL_44" value="0x2b" />
         <value caption="Multiply by 45" name="MUL_45" value="0x2c" />
         <value caption="Multiply by 46" name="MUL_46" value="0x2d" />
         <value caption="Multiply by 47" name="MUL_47" value="0x2e" />
         <value caption="Multiply by 48" name="MUL_48" value="0x2f" />
         <value caption="Multiply by 49" name="MUL_49" value="0x30" />
         <value caption="Multiply by 50" name="MUL_50" value="0x31" />
         <value caption="Multiply by 51" name="MUL_51" value="0x32" />
         <value caption="Multiply by 52" name="MUL_52" value="0x33" />
         <value caption="Multiply by 53" name="MUL_53" value="0x34" />
         <value caption="Multiply by 54" name="MUL_54" value="0x35" />
         <value caption="Multiply by 55" name="MUL_55" value="0x36" />
         <value caption="Multiply by 56" name="MUL_56" value="0x37" />
         <value caption="Multiply by 57" name="MUL_57" value="0x38" />
         <value caption="Multiply by 58" name="MUL_58" value="0x39" />
         <value caption="Multiply by 59" name="MUL_59" value="0x3a" />
         <value caption="Multiply by 60" name="MUL_60" value="0x3b" />
         <value caption="Multiply by 61" name="MUL_61" value="0x3c" />
         <value caption="Multiply by 62" name="MUL_62" value="0x3d" />
         <value caption="Multiply by 63" name="MUL_63" value="0x3e" />
         <value caption="Multiply by 64" name="MUL_64" value="0x3f" />
         <value caption="Multiply by 65" name="MUL_65" value="0x40" />
         <value caption="Multiply by 66" name="MUL_66" value="0x41" />
         <value caption="Multiply by 67" name="MUL_67" value="0x42" />
         <value caption="Multiply by 68" name="MUL_68" value="0x43" />
         <value caption="Multiply by 69" name="MUL_69" value="0x44" />
         <value caption="Multiply by 70" name="MUL_70" value="0x45" />
         <value caption="Multiply by 71" name="MUL_71" value="0x46" />
         <value caption="Multiply by 72" name="MUL_72" value="0x47" />
         <value caption="Multiply by 73" name="MUL_73" value="0x48" />
         <value caption="Multiply by 74" name="MUL_74" value="0x49" />
         <value caption="Multiply by 75" name="MUL_75" value="0x4a" />
         <value caption="Multiply by 76" name="MUL_76" value="0x4b" />
         <value caption="Multiply by 77" name="MUL_77" value="0x4c" />
         <value caption="Multiply by 78" name="MUL_78" value="0x4d" />
         <value caption="Multiply by 79" name="MUL_79" value="0x4e" />
         <value caption="Multiply by 80" name="MUL_80" value="0x4f" />
         <value caption="Multiply by 81" name="MUL_81" value="0x50" />
         <value caption="Multiply by 82" name="MUL_82" value="0x51" />
         <value caption="Multiply by 83" name="MUL_83" value="0x52" />
         <value caption="Multiply by 84" name="MUL_84" value="0x53" />
         <value caption="Multiply by 85" name="MUL_85" value="0x54" />
         <value caption="Multiply by 86" name="MUL_86" value="0x55" />
         <value caption="Multiply by 87" name="MUL_87" value="0x56" />
         <value caption="Multiply by 88" name="MUL_88" value="0x57" />
         <value caption="Multiply by 89" name="MUL_89" value="0x58" />
         <value caption="Multiply by 90" name="MUL_90" value="0x59" />
         <value caption="Multiply by 91" name="MUL_91" value="0x5a" />
         <value caption="Multiply by 92" name="MUL_92" value="0x5b" />
         <value caption="Multiply by 93" name="MUL_93" value="0x5c" />
         <value caption="Multiply by 94" name="MUL_94" value="0x5d" />
         <value caption="Multiply by 95" name="MUL_95" value="0x5e" />
         <value caption="Multiply by 96" name="MUL_96" value="0x5f" />
         <value caption="Multiply by 97" name="MUL_97" value="0x60" />
         <value caption="Multiply by 98" name="MUL_98" value="0x61" />
         <value caption="Multiply by 99" name="MUL_99" value="0x62" />
         <value caption="Multiply by 100" name="MUL_100" value="0x63" />
         <value caption="Multiply by 101" name="MUL_101" value="0x64" />
         <value caption="Multiply by 102" name="MUL_102" value="0x65" />
         <value caption="Multiply by 103" name="MUL_103" value="0x66" />
         <value caption="Multiply by 104" name="MUL_104" value="0x67" />
         <value caption="Multiply by 105" name="MUL_105" value="0x68" />
         <value caption="Multiply by 106" name="MUL_106" value="0x69" />
         <value caption="Multiply by 107" name="MUL_107" value="0x6a" />
         <value caption="Multiply by 108" name="MUL_108" value="0x6b" />
         <value caption="Multiply by 109" name="MUL_109" value="0x6c" />
         <value caption="Multiply by 110" name="MUL_110" value="0x6d" />
         <value caption="Multiply by 111" name="MUL_111" value="0x6e" />
         <value caption="Multiply by 112" name="MUL_112" value="0x6f" />
         <value caption="Multiply by 113" name="MUL_113" value="0x70" />
         <value caption="Multiply by 114" name="MUL_114" value="0x71" />
         <value caption="Multiply by 115" name="MUL_115" value="0x72" />
         <value caption="Multiply by 116" name="MUL_116" value="0x73" />
         <value caption="Multiply by 117" name="MUL_117" value="0x74" />
         <value caption="Multiply by 118" name="MUL_118" value="0x75" />
         <value caption="Multiply by 119" name="MUL_119" value="0x76" />
         <value caption="Multiply by 120" name="MUL_120" value="0x77" />
         <value caption="Multiply by 121" name="MUL_121" value="0x78" />
         <value caption="Multiply by 122" name="MUL_122" value="0x79" />
         <value caption="Multiply by 123" name="MUL_123" value="0x7a" />
         <value caption="Multiply by 124" name="MUL_124" value="0x7b" />
         <value caption="Multiply by 125" name="MUL_125" value="0x7c" />
         <value caption="Multiply by 126" name="MUL_126" value="0x7d" />
         <value caption="Multiply by 127" name="MUL_127" value="0x7e" />
         <value caption="Multiply by 128" name="MUL_128" value="0x7f" />
      </value-group>
      <value-group caption="Default System PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="PLL output divided by 2" name="DIV_2" value="0x1" />
         <value caption="PLL output divided by 4" name="DIV_4" value="0x2" />
         <value caption="PLL output divided by 8" name="DIV_8" value="0x3" />
         <value caption="PLL output divided by 16" name="DIV_16" value="0x4" />
         <value caption="PLL output divided by 32" name="DIV_32" value="0x7" />
      </value-group>
