Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="CAN Interrupt Register" name="C2INT" offset="0x1020" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C2INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C2INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C2INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C2INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C2INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C2INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C2INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C2INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C2INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C2INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C2INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C2INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C2INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C2INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C2INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C2INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C2INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C2INT__IVRIE" />
         </register>
         <register caption="CAN Interrupt Register" name="C3INT" offset="0x4020" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C3INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C3INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C3INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C3INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C3INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C3INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C3INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C3INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C3INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C3INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C3INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C3INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C3INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C3INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C3INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C3INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C3INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C3INT__IVRIE" />
         </register>
         <register caption="CAN Interrupt Register" name="C4INT" offset="0x5020" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C4INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C4INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C4INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C4INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C4INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C4INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C4INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C4INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C4INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C4INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C4INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C4INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C4INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C4INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C4INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C4INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C4INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C4INT__IVRIE" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C1VEC" offset="0x30" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C1VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C1VEC__FILHIT" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C2VEC" offset="0x1030" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C2VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C2VEC__FILHIT" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C3VEC" offset="0x4030" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C3VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C3VEC__FILHIT" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C4VEC" offset="0x5030" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C4VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C4VEC__FILHIT" />
         </register>
         <register caption="CAN Transmit/Receive Error Count Register" name="C1TREC" offset="0x40" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
         <register caption="CAN Transmit/Receive Error Count Register" name="C2TREC" offset="0x1040" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
         <register caption="CAN Transmit/Receive Error Count Register" name="C3TREC" offset="0x4040" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
