Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="CAN Transmit/Receive Error Count Register" name="C4TREC" offset="0x5040" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
         <register caption="CAN FIFO Status Register" name="C1FSTAT" offset="0x50" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C1FSTAT__FIFOIP" />
         </register>
         <register caption="CAN FIFO Status Register" name="C2FSTAT" offset="0x1050" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C2FSTAT__FIFOIP" />
         </register>
         <register caption="CAN FIFO Status Register" name="C3FSTAT" offset="0x4050" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C3FSTAT__FIFOIP" />
         </register>
         <register caption="CAN FIFO Status Register" name="C4FSTAT" offset="0x5050" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C4FSTAT__FIFOIP" />
         </register>
         <register caption="CAN Receive FIFO Overflow Status Register" name="C1RXOVF" offset="0x60" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C1RXOVF__RXOVF" />
         </register>
         <register caption="CAN Receive FIFO Overflow Status Register" name="C2RXOVF" offset="0x1060" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C2RXOVF__RXOVF" />
         </register>
         <register caption="CAN Receive FIFO Overflow Status Register" name="C3RXOVF" offset="0x4060" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C3RXOVF__RXOVF" />
         </register>
         <register caption="CAN Receive FIFO Overflow Status Register" name="C4RXOVF" offset="0x5060" rw="R" size="4">
            <bitfield caption="FIFOx Receive Overflow Interrupt Pending bit" mask="0xFFFFFFFF" name="RXOVF" values="C4RXOVF__RXOVF" />
         </register>
         <register caption="CAN Timer Register" name="C1TMR" offset="0x70" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C1TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Timer Register" name="C2TMR" offset="0x1070" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C2TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Timer Register" name="C3TMR" offset="0x4070" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C3TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Timer Register" name="C4TMR" offset="0x5070" rw="RW" size="4">
            <bitfield caption="CAN Time Stamp Timer Prescaler bits" mask="0x0000FFFF" name="CANTSPRE" values="C4TMR__CANTSPRE" />
            <bitfield mask="0xFFFF0000" name="CANTS" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM0" offset="0x80" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM0" offset="0x1080" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C3RXM0" offset="0x4080" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C3RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C4RXM0" offset="0x5080" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXM0__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C4RXM0__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXM0__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM1" offset="0x90" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM1" offset="0x1090" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C3RXM1" offset="0x4090" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C3RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C4RXM1" offset="0x5090" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXM1__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C4RXM1__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXM1__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM2" offset="0x10a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C3RXM2" offset="0x40a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C3RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXM2__SID" />
         </register>
