Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="CAN Acceptance Filter Mask " name="C4RXM2" offset="0x50a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXM2__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C4RXM2__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXM2__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C1RXM3" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C1RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXM3__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C2RXM3" offset="0x10b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C2RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXM3__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C3RXM3" offset="0x40b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C3RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C3RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C3RXM3__SID" />
         </register>
         <register caption="CAN Acceptance Filter Mask " name="C4RXM3" offset="0x50b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C4RXM3__EID" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x00080000" name="MIDE" values="C4RXM3__MIDE" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C4RXM3__SID" />
         </register>
         <register caption="CAN Filter Control Register 0" name="C1FLTCON0" offset="0xc0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C1FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C1FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C1FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C1FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C1FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C1FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C1FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C1FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C1FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C1FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C1FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C1FLTCON0__FLTEN3" />
         </register>
         <register caption="CAN Filter Control Register 0" name="C2FLTCON0" offset="0x10c0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C2FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C2FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C2FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C2FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C2FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C2FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C2FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C2FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C2FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C2FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C2FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C2FLTCON0__FLTEN3" />
         </register>
         <register caption="CAN Filter Control Register 0" name="C3FLTCON0" offset="0x40c0" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL0" values="C3FLTCON0__FSEL0" />
            <bitfield caption="Filter 0 Mask Select bits" mask="0x00000060" name="MSEL0" values="C3FLTCON0__MSEL0" />
            <bitfield caption="Filter 0 Enable bit" mask="0x00000080" name="FLTEN0" values="C3FLTCON0__FLTEN0" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL1" values="C3FLTCON0__FSEL1" />
            <bitfield caption="Filter 1 Mask Select bits" mask="0x00006000" name="MSEL1" values="C3FLTCON0__MSEL1" />
            <bitfield caption="Filter 1 Enable bit" mask="0x00008000" name="FLTEN1" values="C3FLTCON0__FLTEN1" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL2" values="C3FLTCON0__FSEL2" />
            <bitfield caption="Filter 2 Mask Select bits" mask="0x00600000" name="MSEL2" values="C3FLTCON0__MSEL2" />
            <bitfield caption="Filter 2 Enable bit" mask="0x00800000" name="FLTEN2" values="C3FLTCON0__FLTEN2" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL3" values="C3FLTCON0__FSEL3" />
            <bitfield caption="Filter 3 Mask Select bits" mask="0x60000000" name="MSEL3" values="C3FLTCON0__MSEL3" />
            <bitfield caption="Filter 3 Enable bit" mask="0x80000000" name="FLTEN3" values="C3FLTCON0__FLTEN3" />
         </register>
