Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="CAN FIFO Interrupt Register " name="C3FIFOINT8" offset="0x4560" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C3FIFOINT8__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C3FIFOINT8__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C3FIFOINT8__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C3FIFOINT8__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C3FIFOINT8__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C3FIFOINT8__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C3FIFOINT8__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C3FIFOINT8__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C3FIFOINT8__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C3FIFOINT8__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C3FIFOINT8__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C3FIFOINT8__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C3FIFOINT8__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C3FIFOINT8__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C4FIFOINT8" offset="0x5560" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C4FIFOINT8__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C4FIFOINT8__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C4FIFOINT8__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C4FIFOINT8__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C4FIFOINT8__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C4FIFOINT8__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C4FIFOINT8__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C4FIFOINT8__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C4FIFOINT8__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C4FIFOINT8__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C4FIFOINT8__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C4FIFOINT8__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C4FIFOINT8__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C4FIFOINT8__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C1FIFOUA8" offset="0x570" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C2FIFOUA8" offset="0x1570" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C3FIFOUA8" offset="0x4570" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN FIFO User Address Register " name="C4FIFOUA8" offset="0x5570" rw="R" size="4">
            <bitfield mask="0xFFFFFFFC" name="FIFOUA" />
         </register>
         <register caption="CAN Module Message Index Register " name="C1FIFOCI8" offset="0x580" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C2FIFOCI8" offset="0x1580" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C3FIFOCI8" offset="0x4580" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN Module Message Index Register " name="C4FIFOCI8" offset="0x5580" rw="R" size="4">
            <bitfield mask="0x0000001F" name="CFIFOCI" />
         </register>
         <register caption="CAN FIFO Control Register " name="C1FIFOCON9" offset="0x590" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON9__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON9__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON9__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON9__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON9__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON9__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON9__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON9__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON9__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON9__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON9__FSIZE" />
         </register>
