Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="CAN FIFO Control Register " name="C2FIFOCON9" offset="0x1590" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C2FIFOCON9__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C2FIFOCON9__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C2FIFOCON9__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C2FIFOCON9__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C2FIFOCON9__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C2FIFOCON9__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C2FIFOCON9__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C2FIFOCON9__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C2FIFOCON9__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C2FIFOCON9__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C2FIFOCON9__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C3FIFOCON9" offset="0x4590" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C3FIFOCON9__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C3FIFOCON9__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C3FIFOCON9__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C3FIFOCON9__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C3FIFOCON9__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C3FIFOCON9__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C3FIFOCON9__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C3FIFOCON9__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C3FIFOCON9__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C3FIFOCON9__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C3FIFOCON9__FSIZE" />
         </register>
         <register caption="CAN FIFO Control Register " name="C4FIFOCON9" offset="0x5590" rw="RW" size="4">
            <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C4FIFOCON9__TXPRI" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C4FIFOCON9__RTREN" />
            <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C4FIFOCON9__TXREQ" />
            <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C4FIFOCON9__TXERR" />
            <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C4FIFOCON9__TXLARB" />
            <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C4FIFOCON9__TXABAT" />
            <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C4FIFOCON9__TXEN" />
            <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C4FIFOCON9__DONLY" />
            <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C4FIFOCON9__UINC" />
            <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C4FIFOCON9__FRESET" />
            <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C4FIFOCON9__FSIZE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT9" offset="0x5a0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT9__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT9__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT9__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT9__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT9__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT9__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT9__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT9__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT9__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT9__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT9__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT9__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT9__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT9__TXNFULLIE" />
         </register>
         <register caption="CAN FIFO Interrupt Register " name="C2FIFOINT9" offset="0x15a0" rw="RW" size="4">
            <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C2FIFOINT9__RXNEMPTYIF" />
            <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C2FIFOINT9__RXHALFIF" />
            <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C2FIFOINT9__RXFULLIF" />
            <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C2FIFOINT9__RXOVFLIF" />
            <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C2FIFOINT9__TXEMPTYIF" />
            <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C2FIFOINT9__TXHALFIF" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C2FIFOINT9__TXNFULLIF" />
            <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C2FIFOINT9__RXNEMPTYIE" />
            <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C2FIFOINT9__RXHALFIE" />
            <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C2FIFOINT9__RXFULLIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C2FIFOINT9__RXOVFLIE" />
            <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C2FIFOINT9__TXEMPTYIE" />
            <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C2FIFOINT9__TXHALFIE" />
            <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C2FIFOINT9__TXNFULLIE" />
         </register>
