Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
      <value-group caption="CAN Module is Busy bit" name="C1CON__CANBUSY">
         <value caption="The CAN module is active" name="" value="0x1" />
         <value caption="The CAN module is completely disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN On bit" name="C1CON__ON">
         <value caption="CAN module is enabled" name="" value="0x1" />
         <value caption="CAN module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Message Receive Time Stamp Timer Capture Enable bit" name="C1CON__CANCAP">
         <value caption="CANTMR value is stored on valid message reception and is stored with the message" name="" value="0x10" />
         <value caption="Disable CAN message receive time stamp timer capture and stop CANTMR to conserve power" name="" value="0x0" />
      </value-group>
      <value-group caption="Operation Mode Status bits" name="C1CON__OPMOD">
         <value caption="Module is in Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Module is in Configuration mode" name="" value="0x4" />
         <value caption="Module is in Listen Only mode" name="" value="0x3" />
         <value caption="Module is in Loopback mode" name="" value="0x2" />
         <value caption="Module is in Disable mode" name="" value="0x1" />
         <value caption="Module is in Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Request Operation Mode bits" name="C1CON__REQOP">
         <value caption="Set Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved - Do not use" name="" value="0x6" />
         <value caption="Reserved - Do not use" name="" value="0x5" />
         <value caption="Set Configuration mode" name="" value="0x4" />
         <value caption="Set Listen Only mode" name="" value="0x3" />
         <value caption="Set Loopback mode" name="" value="0x2" />
         <value caption="Set Disable mode" name="" value="0x1" />
         <value caption="Set Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Abort All Pending Transmissions bit" name="C1CON__ABAT">
         <value caption="Signal all transmit buffers to abort transmission" name="" value="0x1" />
         <value caption="Module will clear this bit when all transmissions aborted" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Net Filter Bit Number bits" name="C2CON__DNCNT">
         <value caption="Invalid Selection (compare up to 18-bits of data with EID)" name="" value="10011-11111" />
         <value caption="Compare up to data byte 2 bit 6 with EID17 (CiRXFn)" name="" value="0x12" />
         <value caption="Compare up to data byte 0 bit 7 with EID0 (CiRXFn)" name="" value="0x1" />
         <value caption="Do not compare data bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Module is Busy bit" name="C2CON__CANBUSY">
         <value caption="The CAN module is active" name="" value="0x1" />
         <value caption="The CAN module is completely disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN On bit" name="C2CON__ON">
         <value caption="CAN module is enabled" name="" value="0x1" />
         <value caption="CAN module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Message Receive Time Stamp Timer Capture Enable bit" name="C2CON__CANCAP">
         <value caption="CANTMR value is stored on valid message reception and is stored with the message" name="" value="0x10" />
         <value caption="Disable CAN message receive time stamp timer capture and stop CANTMR to conserve power" name="" value="0x0" />
      </value-group>
      <value-group caption="Operation Mode Status bits" name="C2CON__OPMOD">
         <value caption="Module is in Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Module is in Configuration mode" name="" value="0x4" />
         <value caption="Module is in Listen Only mode" name="" value="0x3" />
         <value caption="Module is in Loopback mode" name="" value="0x2" />
         <value caption="Module is in Disable mode" name="" value="0x1" />
         <value caption="Module is in Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Request Operation Mode bits" name="C2CON__REQOP">
         <value caption="Set Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved - Do not use" name="" value="0x6" />
         <value caption="Reserved - Do not use" name="" value="0x5" />
         <value caption="Set Configuration mode" name="" value="0x4" />
         <value caption="Set Listen Only mode" name="" value="0x3" />
         <value caption="Set Loopback mode" name="" value="0x2" />
         <value caption="Set Disable mode" name="" value="0x1" />
         <value caption="Set Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Abort All Pending Transmissions bit" name="C2CON__ABAT">
         <value caption="Signal all transmit buffers to abort transmission" name="" value="0x1" />
         <value caption="Module will clear this bit when all transmissions aborted" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Net Filter Bit Number bits" name="C3CON__DNCNT">
         <value caption="Invalid Selection (compare up to 18-bits of data with EID)" name="" value="10011-11111" />
         <value caption="Compare up to data byte 2 bit 6 with EID17 (CiRXFn)" name="" value="0x12" />
         <value caption="Compare up to data byte 0 bit 7 with EID0 (CiRXFn)" name="" value="0x1" />
         <value caption="Do not compare data bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Module is Busy bit" name="C3CON__CANBUSY">
         <value caption="The CAN module is active" name="" value="0x1" />
         <value caption="The CAN module is completely disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN On bit" name="C3CON__ON">
         <value caption="CAN module is enabled" name="" value="0x1" />
         <value caption="CAN module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Message Receive Time Stamp Timer Capture Enable bit" name="C3CON__CANCAP">
         <value caption="CANTMR value is stored on valid message reception and is stored with the message" name="" value="0x10" />
         <value caption="Disable CAN message receive time stamp timer capture and stop CANTMR to conserve power" name="" value="0x0" />
      </value-group>
