Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="USB PLL Control Register" name="UPLLCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="System PLL Frequency Range Selection bits" mask="0x00000007" name="PLLRANGE" values="UPLLCON__PLLRANGE" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="UPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier Output Clock Divider bits" mask="0x007F0000" name="PLLMULT" values="UPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="UPLLCON__PLLODIV" />
            <bitfield caption="Output Enable bit" mask="0x20000000" name="UPOSCEN" values="UPLLCON__UPOSCEN" />
         </register>
         <register caption="Reset Control Register" name="RCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x00000020" name="DMTO" values="RCON__DMTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="Deep Sleep Mode Flag bit" mask="0x00000400" name="DPSLP" values="RCON__DPSLP" />
            <bitfield caption="VBAT Mode Flag bit" mask="0x00010000" name="VBAT" values="RCON__VBAT" />
            <bitfield caption="VBPOR Mode Flag bit" mask="0x00020000" name="VBPOR" values="RCON__VBPOR" />
            <bitfield caption="Core Voltage POR Flag bit" mask="0x40000000" name="PORCORE" values="RCON__PORCORE" />
            <bitfield caption="I/O Voltage POR Flag bit" mask="0x80000000" name="PORIO" values="RCON__PORIO" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x50" rw="W" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
         <register caption="Non-Maskable Interrupt (NMI) Control Register" name="RNMICON" offset="0x60" rw="RW" size="4">
            <bitfield caption="NMI Reset Counter Value bits" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit (Setting this bit will cause a WDT NMI)" mask="0x00010000" name="WDTS" values="RNMICON__WDTS" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF" />
            <bitfield mask="0x00040000" name="HLVD" />
            <bitfield caption="General NMI bit" mask="0x00080000" name="GNMI" values="RNMICON__GNMI" />
            <bitfield caption="Software NMI Trigger." mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI" />
            <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x01000000" name="WDTO" values="RNMICON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x02000000" name="DMTO" values="RNMICON__DMTO" />
         </register>
         <register caption="Power Control Register" name="PWRCON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Internal Voltage Regulator Stand-by Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS" />
            <bitfield mask="0x00000030" name="VREGSLP" />
            <bitfield mask="0x000000C0" name="VREGRUN" />
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO1CON" offset="0x80" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON"/>
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV"/>
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO2CON" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO2CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON"/>
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON__RODIV"/>
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO3CON" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO3CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON"/>
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON__RODIV"/>
         </register>
