Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="" name="CNSTATF" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF0" />
            <bitfield mask="0x00000002" name="CNSTATF1" />
            <bitfield mask="0x00000020" name="CNSTATF5" />
            <bitfield mask="0x00000040" name="CNSTATF6" />
            <bitfield mask="0x00000080" name="CNSTATF7" />
            <bitfield mask="0x00000200" name="CNSTATF9" />
            <bitfield mask="0x00000400" name="CNSTATF10" />
            <bitfield mask="0x00001000" name="CNSTATF12" />
            <bitfield mask="0x00002000" name="CNSTATF13" />
         </register>
         <register caption="" name="CNSTATG" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG0" />
            <bitfield mask="0x00000002" name="CNSTATG1" />
            <bitfield mask="0x00000040" name="CNSTATG6" />
            <bitfield mask="0x00000080" name="CNSTATG7" />
            <bitfield mask="0x00000100" name="CNSTATG8" />
            <bitfield mask="0x00000200" name="CNSTATG9" />
            <bitfield mask="0x00000400" name="CNSTATG10" />
            <bitfield mask="0x00000800" name="CNSTATG11" />
            <bitfield mask="0x00001000" name="CNSTATG12" />
            <bitfield mask="0x00002000" name="CNSTATG13" />
            <bitfield mask="0x00004000" name="CNSTATG14" />
            <bitfield mask="0x00008000" name="CNSTATG15" />
         </register>
         <register caption="" name="CNNEA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEA0" />
            <bitfield mask="0x00000002" name="CNNEA1" />
            <bitfield mask="0x00000010" name="CNNEA4" />
            <bitfield mask="0x00000080" name="CNNEA7" />
            <bitfield mask="0x00000100" name="CNNEA8" />
            <bitfield mask="0x00000400" name="CNNEA10" />
            <bitfield mask="0x00000800" name="CNNEA11" />
            <bitfield mask="0x00001000" name="CNNEA12" />
            <bitfield mask="0x00004000" name="CNNEA14" />
            <bitfield mask="0x00008000" name="CNNEA15" />
         </register>
         <register caption="" name="CNNEB" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEB0" />
            <bitfield mask="0x00000002" name="CNNEB1" />
            <bitfield mask="0x00000004" name="CNNEB2" />
            <bitfield mask="0x00000008" name="CNNEB3" />
            <bitfield mask="0x00000010" name="CNNEB4" />
            <bitfield mask="0x00000020" name="CNNEB5" />
            <bitfield mask="0x00000040" name="CNNEB6" />
            <bitfield mask="0x00000080" name="CNNEB7" />
            <bitfield mask="0x00000100" name="CNNEB8" />
            <bitfield mask="0x00000200" name="CNNEB9" />
            <bitfield mask="0x00000400" name="CNNEB10" />
            <bitfield mask="0x00000800" name="CNNEB11" />
            <bitfield mask="0x00001000" name="CNNEB12" />
            <bitfield mask="0x00002000" name="CNNEB13" />
            <bitfield mask="0x00004000" name="CNNEB14" />
            <bitfield mask="0x00008000" name="CNNEB15" />
         </register>
         <register caption="" name="CNNEC" offset="0x2a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEC0" />
            <bitfield mask="0x00000002" name="CNNEC1" />
            <bitfield mask="0x00000004" name="CNNEC2" />
            <bitfield mask="0x00000040" name="CNNEC6" />
            <bitfield mask="0x00000080" name="CNNEC7" />
            <bitfield mask="0x00000100" name="CNNEC8" />
            <bitfield mask="0x00000200" name="CNNEC9" />
            <bitfield mask="0x00000400" name="CNNEC10" />
            <bitfield mask="0x00000800" name="CNNEC11" />
            <bitfield mask="0x00001000" name="CNNEC12" />
            <bitfield mask="0x00002000" name="CNNEC13" />
            <bitfield mask="0x00004000" name="CNNEC14" />
            <bitfield mask="0x00008000" name="CNNEC15" />
         </register>
         <register caption="" name="CNNED" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="CNNED1" />
            <bitfield mask="0x00000004" name="CNNED2" />
            <bitfield mask="0x00000008" name="CNNED3" />
            <bitfield mask="0x00000010" name="CNNED4" />
            <bitfield mask="0x00000020" name="CNNED5" />
            <bitfield mask="0x00000040" name="CNNED6" />
            <bitfield mask="0x00000100" name="CNNED8" />
            <bitfield mask="0x00001000" name="CNNED12" />
            <bitfield mask="0x00002000" name="CNNED13" />
            <bitfield mask="0x00004000" name="CNNED14" />
            <bitfield mask="0x00008000" name="CNNED15" />
         </register>
         <register caption="" name="CNNEE" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEE0" />
            <bitfield mask="0x00000002" name="CNNEE1" />
            <bitfield mask="0x00000100" name="CNNEE8" />
            <bitfield mask="0x00000200" name="CNNEE9" />
            <bitfield mask="0x00001000" name="CNNEE12" />
            <bitfield mask="0x00002000" name="CNNEE13" />
            <bitfield mask="0x00004000" name="CNNEE14" />
            <bitfield mask="0x00008000" name="CNNEE15" />
         </register>
         <register caption="" name="CNNEF" offset="0x5a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEF0" />
            <bitfield mask="0x00000002" name="CNNEF1" />
            <bitfield mask="0x00000020" name="CNNEF5" />
            <bitfield mask="0x00000040" name="CNNEF6" />
            <bitfield mask="0x00000080" name="CNNEF7" />
            <bitfield mask="0x00000200" name="CNNEF9" />
            <bitfield mask="0x00000400" name="CNNEF10" />
            <bitfield mask="0x00001000" name="CNNEF12" />
            <bitfield mask="0x00002000" name="CNNEF13" />
         </register>
         <register caption="" name="CNNEG" offset="0x6a0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNNEG0" />
            <bitfield mask="0x00000002" name="CNNEG1" />
            <bitfield mask="0x00000040" name="CNNEG6" />
            <bitfield mask="0x00000080" name="CNNEG7" />
            <bitfield mask="0x00000100" name="CNNEG8" />
            <bitfield mask="0x00000200" name="CNNEG9" />
            <bitfield mask="0x00000400" name="CNNEG10" />
            <bitfield mask="0x00000800" name="CNNEG11" />
            <bitfield mask="0x00001000" name="CNNEG12" />
            <bitfield mask="0x00002000" name="CNNEG13" />
            <bitfield mask="0x00004000" name="CNNEG14" />
            <bitfield mask="0x00008000" name="CNNEG15" />
         </register>
         <register caption="" name="CNFA" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFA0" />
            <bitfield mask="0x00000002" name="CNFA1" />
            <bitfield mask="0x00000010" name="CNFA4" />
            <bitfield mask="0x00000080" name="CNFA7" />
            <bitfield mask="0x00000100" name="CNFA8" />
            <bitfield mask="0x00000400" name="CNFA10" />
            <bitfield mask="0x00000800" name="CNFA11" />
            <bitfield mask="0x00001000" name="CNFA12" />
            <bitfield mask="0x00004000" name="CNFA14" />
            <bitfield mask="0x00008000" name="CNFA15" />
         </register>
         <register caption="" name="CNFB" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFB0" />
            <bitfield mask="0x00000002" name="CNFB1" />
            <bitfield mask="0x00000004" name="CNFB2" />
            <bitfield mask="0x00000008" name="CNFB3" />
            <bitfield mask="0x00000010" name="CNFB4" />
            <bitfield mask="0x00000020" name="CNFB5" />
            <bitfield mask="0x00000040" name="CNFB6" />
            <bitfield mask="0x00000080" name="CNFB7" />
            <bitfield mask="0x00000100" name="CNFB8" />
            <bitfield mask="0x00000200" name="CNFB9" />
            <bitfield mask="0x00000400" name="CNFB10" />
            <bitfield mask="0x00000800" name="CNFB11" />
            <bitfield mask="0x00001000" name="CNFB12" />
            <bitfield mask="0x00002000" name="CNFB13" />
            <bitfield mask="0x00004000" name="CNFB14" />
            <bitfield mask="0x00008000" name="CNFB15" />
         </register>
         <register caption="" name="CNFC" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFC0" />
            <bitfield mask="0x00000002" name="CNFC1" />
            <bitfield mask="0x00000004" name="CNFC2" />
            <bitfield mask="0x00000040" name="CNFC6" />
            <bitfield mask="0x00000080" name="CNFC7" />
            <bitfield mask="0x00000100" name="CNFC8" />
            <bitfield mask="0x00000200" name="CNFC9" />
            <bitfield mask="0x00000400" name="CNFC10" />
            <bitfield mask="0x00000800" name="CNFC11" />
            <bitfield mask="0x00001000" name="CNFC12" />
            <bitfield mask="0x00002000" name="CNFC13" />
            <bitfield mask="0x00004000" name="CNFC14" />
            <bitfield mask="0x00008000" name="CNFC15" />
         </register>
         <register caption="" name="CNFD" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="CNFD1" />
            <bitfield mask="0x00000004" name="CNFD2" />
            <bitfield mask="0x00000008" name="CNFD3" />
            <bitfield mask="0x00000010" name="CNFD4" />
            <bitfield mask="0x00000020" name="CNFD5" />
            <bitfield mask="0x00000040" name="CNFD6" />
            <bitfield mask="0x00000100" name="CNFD8" />
            <bitfield mask="0x00001000" name="CNFD12" />
            <bitfield mask="0x00002000" name="CNFD13" />
            <bitfield mask="0x00004000" name="CNFD14" />
            <bitfield mask="0x00008000" name="CNFD15" />
         </register>
         <register caption="" name="CNFE" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFE0" />
            <bitfield mask="0x00000002" name="CNFE1" />
            <bitfield mask="0x00000100" name="CNFE8" />
            <bitfield mask="0x00000200" name="CNFE9" />
            <bitfield mask="0x00001000" name="CNFE12" />
            <bitfield mask="0x00002000" name="CNFE13" />
            <bitfield mask="0x00004000" name="CNFE14" />
            <bitfield mask="0x00008000" name="CNFE15" />
         </register>
         <register caption="" name="CNFF" offset="0x5b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFF0" />
            <bitfield mask="0x00000002" name="CNFF1" />
            <bitfield mask="0x00000020" name="CNFF5" />
            <bitfield mask="0x00000040" name="CNFF6" />
            <bitfield mask="0x00000080" name="CNFF7" />
            <bitfield mask="0x00000200" name="CNFF9" />
            <bitfield mask="0x00000400" name="CNFF10" />
            <bitfield mask="0x00001000" name="CNFF12" />
            <bitfield mask="0x00002000" name="CNFF13" />
         </register>
         <register caption="" name="CNFG" offset="0x6b0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNFG0" />
            <bitfield mask="0x00000002" name="CNFG1" />
            <bitfield mask="0x00000040" name="CNFG6" />
            <bitfield mask="0x00000080" name="CNFG7" />
            <bitfield mask="0x00000100" name="CNFG8" />
            <bitfield mask="0x00000200" name="CNFG9" />
            <bitfield mask="0x00000400" name="CNFG10" />
            <bitfield mask="0x00000800" name="CNFG11" />
            <bitfield mask="0x00001000" name="CNFG12" />
            <bitfield mask="0x00002000" name="CNFG13" />
            <bitfield mask="0x00004000" name="CNFG14" />
            <bitfield mask="0x00008000" name="CNFG15" />
         </register>
         <register caption="" name="SRCON0A" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000080" name="SR0A7" />
            <bitfield mask="0x00000100" name="SR0A8" />
            <bitfield mask="0x00000400" name="SR0A10" />
         </register>
         <register caption="" name="SRCON0B" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="SR0B4" />
            <bitfield mask="0x00000040" name="SR0B6" />
            <bitfield mask="0x00000080" name="SR0B7" />
            <bitfield mask="0x00000400" name="SR0B10" />
            <bitfield mask="0x00000800" name="SR0B11" />
            <bitfield mask="0x00001000" name="SR0B12" />
            <bitfield mask="0x00002000" name="SR0B13" />
            <bitfield mask="0x00004000" name="SR0B14" />
            <bitfield mask="0x00008000" name="SR0B15" />
         </register>
         <register caption="" name="SRCON0C" offset="0x2c0" rw="RW" size="4">
            <bitfield mask="0x00000040" name="SR0C6" />
            <bitfield mask="0x00000080" name="SR0C7" />
            <bitfield mask="0x00000100" name="SR0C8" />
            <bitfield mask="0x00000200" name="SR0C9" />
            <bitfield mask="0x00000800" name="SR0C11" />
            <bitfield mask="0x00008000" name="SR0C15" />
         </register>
         <register caption="" name="SRCON0D" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="SR0D1" />
            <bitfield mask="0x00000004" name="SR0D2" />
            <bitfield mask="0x00000008" name="SR0D3" />
            <bitfield mask="0x00000010" name="SR0D4" />
            <bitfield mask="0x00000020" name="SR0D5" />
            <bitfield mask="0x00000040" name="SR0D6" />
            <bitfield mask="0x00000100" name="SR0D8" />
         </register>
         <register caption="" name="SRCON0E" offset="0x4c0" rw="RW" size="4">
            <bitfield mask="0x00001000" name="SR0E12" />
            <bitfield mask="0x00002000" name="SR0E13" />
            <bitfield mask="0x00004000" name="SR0E14" />
            <bitfield mask="0x00008000" name="SR0E15" />
         </register>
         <register caption="" name="SRCON0F" offset="0x5c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0F0" />
            <bitfield mask="0x00000002" name="SR0F1" />
         </register>
         <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000080" name="SR1A7" />
            <bitfield mask="0x00000100" name="SR1A8" />
            <bitfield mask="0x00000400" name="SR1A10" />
         </register>
