Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
   <module caption="" id="00740" name="ICAP" version="1">
      <register-group name="ICAP">
         <register caption="Input Capture x Control Register" name="IC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC1CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC1CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC1CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC1CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC1CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC1CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC1CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC1CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC1CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC2CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC2CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC2CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC2CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC2CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC2CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC2CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC2CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC2CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC3CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC3CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC3CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC3CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC3CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC3CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC3CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC3CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC3CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC4CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC4CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC4CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC4CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC4CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC4CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC4CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC4CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC4CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC5CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC5CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC5CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC5CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC5CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC5CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC5CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC5CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC5CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC6CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC6CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC6CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC6CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC6CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC6CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC6CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC6CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC6CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC7CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC7CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC7CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC7CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC7CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC7CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC7CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC7CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC7CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC7CON__ON" />
         </register>
