Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="Interrupt Vector Address Offset Register" name="OFF109" offset="0x6f4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF110" offset="0x6f8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF111" offset="0x6fc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF112" offset="0x700" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF113" offset="0x704" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF114" offset="0x708" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF115" offset="0x70c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF116" offset="0x710" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF117" offset="0x714" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF118" offset="0x718" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF119" offset="0x71c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF120" offset="0x720" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF121" offset="0x724" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF122" offset="0x728" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF123" offset="0x72c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF124" offset="0x730" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF125" offset="0x734" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF126" offset="0x738" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF127" offset="0x73c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF128" offset="0x740" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF129" offset="0x744" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF130" offset="0x748" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF131" offset="0x74c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF132" offset="0x750" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF133" offset="0x754" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF139" offset="0x76c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF140" offset="0x770" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF141" offset="0x774" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF142" offset="0x778" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF143" offset="0x77c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF144" offset="0x780" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF145" offset="0x784" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF146" offset="0x788" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
