Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
         <register caption="" name="RPB10R" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB10R" />
         </register>
         <register caption="" name="RPB11R" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB11R" />
         </register>
         <register caption="" name="RPB12R" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB12R" />
         </register>
         <register caption="" name="RPB13R" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB13R" />
         </register>
         <register caption="" name="RPB14R" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB15R" />
         </register>
         <register caption="" name="RPC0R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC0R" />
         </register>
         <register caption="" name="RPC1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC2R" />
         </register>
         <register caption="" name="RPC4R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC4R" />
         </register>
         <register caption="" name="RPC6R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC6R" />
         </register>
         <register caption="" name="RPC7R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC7R" />
         </register>
         <register caption="" name="RPC8R" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC8R" />
         </register>
         <register caption="" name="RPC9R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC9R" />
         </register>
         <register caption="" name="RPC10R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC10R" />
         </register>
         <register caption="" name="RPC12R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC12R" />
         </register>
         <register caption="" name="RPC15R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC15R" />
         </register>
         <register caption="" name="RPD3R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD3R" />
         </register>
         <register caption="" name="RPD4R" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD4R" />
         </register>
         <register caption="" name="RPD5R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD5R" />
         </register>
         <register caption="" name="RPD6R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD6R" />
         </register>
         <register caption="" name="RPE0R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE0R" />
         </register>
         <register caption="" name="RPE1R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE1R" />
         </register>
         <register caption="" name="RPE14R" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE14R" />
         </register>
         <register caption="" name="RPE15R" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE15R" />
         </register>
         <register caption="" name="RPF0R" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPF0R" />
         </register>
         <register caption="" name="RPF1R" offset="0x144" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPF1R" />
         </register>
         <register caption="" name="RPG0R" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG0R" />
         </register>
         <register caption="" name="RPG1R" offset="0x184" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG1R" />
         </register>
         <register caption="" name="RPG6R" offset="0x198" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG6R" />
         </register>
         <register caption="" name="RPG7R" offset="0x19c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG7R" />
         </register>
         <register caption="" name="RPG8R" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG8R" />
         </register>
         <register caption="" name="RPG9R" offset="0x1a4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG9R" />
         </register>
         <register caption="" name="RPG12R" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPG12R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01261" name="RTCC" version="2">
      <register-group name="RTCC">
         <register caption="Real-Time Clock and Calendar Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE" />
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC" />
            <bitfield caption="Real-Time Clock Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC" />
            <bitfield caption="Real-Time Clock Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN" />
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON" />
            <bitfield caption="RTCC Output Data Select bits" mask="0x00000180" name="RTCOUTSEL" values="RTCCON__RTCOUTSEL" />
            <bitfield caption="RTCC Clock Select bits" mask="0x00000600" name="RTCCLKSEL" values="RTCCON__RTCCLKSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON" />
            <bitfield caption="Real-Time Clock Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL" />
         </register>
