Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK1024GPE100.atdf
      <value-group caption="Live Differential Receiver JSTATE flag bit" name="U1CON__JSTATE">
         <value caption="JSTATE detected on the USB" name="" value="0x1" />
         <value caption="No JSTATE detected" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode)USB Module Enable bit / (Host mode)" name="U2CON__USBEN_SOFEN">
         <value caption="(Device mode)USB module and supporting circuitry is enabled / (Host mode)SOF token sent every 1 ms" name="" value="0x1" />
         <value caption="(Device mode)USB module and supporting circuitry is disabled / (Host mode)SOF token disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Ping-Pong Buffers Reset bit" name="U2CON__PPBRST">
         <value caption="Reset all Even/Odd buffer pointers to the EVEN BD banks" name="" value="0x1" />
         <value caption="Even/Odd buffer pointers not being Reset" name="" value="0x0" />
      </value-group>
      <value-group caption="RESUME Signaling Enable bit" name="U2CON__RESUME">
         <value caption="RESUME signaling is activated" name="" value="0x1" />
         <value caption="RESUME signaling is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Host Mode Enable bit" name="U2CON__HOSTEN">
         <value caption="USB host capability is enabled" name="" value="0x1" />
         <value caption="USB host capability is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Module Reset bit" name="U2CON__USBRST">
         <value caption="USB reset is generated" name="" value="0x1" />
         <value caption="USB reset is terminated" name="" value="0x0" />
      </value-group>
      <value-group caption="(Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit" name="U2CON__PKTDIS_TOKBUSY">
         <value caption="(Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module" name="" value="0x1" />
         <value caption="(Device mode)Token and packet processing enabled / (Host mode)No token being executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Single-Ended Zero flag bit" name="U2CON__SE0">
         <value caption="Single Ended Zero detected on the USB" name="" value="0x1" />
         <value caption="No Single Ended Zero detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Differential Receiver JSTATE flag bit" name="U2CON__JSTATE">
         <value caption="JSTATE detected on the USB" name="" value="0x1" />
         <value caption="No JSTATE detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Low Speed Enable Indicator bit" name="U1ADDR__LSPDEN">
         <value caption="Next token command to be executed at Low Speed" name="" value="0x1" />
         <value caption="Next token command to be executed at Full Speed" name="" value="0x0" />
      </value-group>
      <value-group caption="Low Speed Enable Indicator bit" name="U2ADDR__LSPDEN">
         <value caption="Next token command to be executed at Low Speed" name="" value="0x1" />
         <value caption="Next token command to be executed at Full Speed" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Type Indicator bits" name="U1TOK__PID">
         <value caption="OUT (TX) token type transaction" name="" value="0x1" />
         <value caption="IN (RX) token type transaction" name="" value="0x9" />
         <value caption="SETUP (TX) token type transaction" name="" value="0xd" />
         <value caption="reserved" name="" value="0x0" />
         <value caption="reserved" name="" value="0x2" />
         <value caption="reserved" name="" value="0x3" />
         <value caption="reserved" name="" value="0x4" />
         <value caption="reserved" name="" value="0x5" />
         <value caption="reserved" name="" value="0x6" />
         <value caption="reserved" name="" value="0x7" />
         <value caption="reserved" name="" value="0x8" />
         <value caption="reserved" name="" value="0xa" />
         <value caption="reserved" name="" value="0xb" />
         <value caption="reserved" name="" value="0xc" />
         <value caption="reserved" name="" value="0xe" />
         <value caption="reserved" name="" value="0xf" />
      </value-group>
      <value-group caption="Token Type Indicator bits" name="U2TOK__PID">
         <value caption="OUT (TX) token type transaction" name="" value="0x1" />
         <value caption="IN (RX) token type transaction" name="" value="0x9" />
         <value caption="SETUP (TX) token type transaction" name="" value="0xd" />
         <value caption="reserved" name="" value="0x0" />
         <value caption="reserved" name="" value="0x2" />
         <value caption="reserved" name="" value="0x3" />
         <value caption="reserved" name="" value="0x4" />
         <value caption="reserved" name="" value="0x5" />
         <value caption="reserved" name="" value="0x6" />
         <value caption="reserved" name="" value="0x7" />
         <value caption="reserved" name="" value="0x8" />
         <value caption="reserved" name="" value="0xa" />
         <value caption="reserved" name="" value="0xb" />
         <value caption="reserved" name="" value="0xc" />
         <value caption="reserved" name="" value="0xe" />
         <value caption="reserved" name="" value="0xf" />
      </value-group>
      <value-group caption="SOF Threshold Value bits" name="U1SOF__CNT">
         <value caption="64-byte packet" name="" value="0x4a" />
         <value caption="32-byte packet" name="" value="0x2a" />
         <value caption="16-byte packet" name="" value="0x1a" />
         <value caption="8-byte packet" name="" value="0x12" />
      </value-group>
      <value-group caption="SOF Threshold Value bits" name="U2SOF__CNT">
         <value caption="64-byte packet" name="" value="0x4a" />
         <value caption="32-byte packet" name="" value="0x2a" />
         <value caption="16-byte packet" name="" value="0x1a" />
         <value caption="8-byte packet" name="" value="0x12" />
      </value-group>
      <value-group caption="Automatic Suspend Enable bit" name="U1CNFG1__UASUSPND">
         <value caption="USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in" name="" value="0x1" />
         <value caption="USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Speed Device Enable bit" name="U1CNFG1__LSDEV">
         <value caption="USB module to operate in Low-Speed Device mode" name="" value="0x1" />
         <value caption="USB module to operate in OTG" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1CNFG1__USBSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
